Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: །བམ་པོ་ཉི་ཤུ་བརྒྱད་པ།
en: Sāgara­megha

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དེ་བཞིན་རྗེས་སུ་བསམ་པ་དང་། ཡེ་ཤེས་སྣང་བ་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དེ་རྣམ་པར་དཔྱད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་དེ་རྗེས་སུ་སྦྱང་བ་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོའི་ཚུལ་དེ་བལྟ་བ་དང་། སངས་རྒྱས་ཀྱི་དཀྱིལ་འཁོར་དེ་ལ་མངོན་པར་མོས་པར་བྱ་བ་དང་། སངས་རྒྱས་བལྟ་བའི་ཕྱོགས་དེ་ལ་མངོན་པར་སྤྲོ་བར་བྱ་བ་དང་། སངས་རྒྱས་རྒྱ་མཚོ་དེ་ལ་རྗེས་སུ་བསམ་པ་དང་། སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཚུལ་རྟོགས་པར་བྱ་བ་དེ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ནམ་མཁའ་དེ་ལ་རྗེས་སུ་བལྟ་བར་བྱེད་ཅིང་།
en: Then Sudhana, the head merchant’s son, contemplated the instruction of that kalyāṇamitra. He remembered the radiance of his wisdom. He analyzed that bodhisattva’s liberation. He reflected on the bodhisattva’s way of samādhi. He looked at the way of an ocean of bodhisattvas. He aspired toward the domain of buddhahood. He delighted in the direction of the vision of the buddhas. He contemplated the ocean of buddhas. He remembered the succession of buddhas. He comprehended that which is understood in the way of the buddhas. He looked into the sky of the buddhas.

source: མཐར་གྱིས་ཕྱོགས་ཀྱིས་ལྗོངས་རྒྱ་མཚོའི་སྒོ་གང་ན་བ་དང་། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Eventually he arrived in the area called Sāgara­mukha and went to where the bhikṣu Sāgara­megha was.

source: དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱི་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་ཞུགས་ཏེ།
en: He bowed his head to the feet of the bhikṣu Sāgara­megha, circumambulated him many hundreds of thousands of times, keeping him to his right, sat before him, and with palms together said, “Ārya, I am set on the highest, complete enlightenment.

source: བླ་ན་མེད་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་ལ་འཇུག་པར་འཚལ་ན།
en: I seek to enter the ocean of the highest wisdom.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཇིག་རྟེན་གྱི་རྒྱུད་ལས་ཕྱིར་ལྡོག་ཅིང་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་འགྲུབ་པར་འགྱུར་བ་དང་། འཁོར་བའི་རྒྱ་མཚོ་ལས་རྒལ་ཞིང་ཐམས་ཅད་མཁྱེན་པའི་རྒྱ་མཚོར་འཇུག་པར་འགྱུར་བ་དང་། བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་གྱེན་དུ་འཕགས་པར་འགྱུར་ཞིང་།
en: However, I do not know how bodhisattvas turn away from worldly existences and attain the family of the tathāgatas; how they cross the ocean of existence and enter the ocean of omniscience; how they transcend the level of foolish, ordinary beings and attain the family of the tathāgatas;

source: དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་འགྲུབ་པར་འགྱུར་བ་དང་། འཁོར་བའི་རྒྱུད་ལས་ལྡོག་པར་འགྱུར་ཞིང་།
en: how they turn away from the flow of saṃsāra and enter the flow of bodhisattva conduct;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུད་དུ་འཇུག་པར་འགྱུར་བ་དང་། འཁོར་བའི་རྒྱ་མཚོ་རྒྱུད་ཀྱི་འཁོར་ལོ་ལས་ཕྱིར་ལྡོག་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་འཁོར་ལོར་འཇུག་པར་འགྱུར་བ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རབ་ཏུ་འཇོམས་ཤིང་སངས་རྒྱས་ཀྱི་དཀྱིལ་འཁོར་འབྱུང་བ་ཐམས་ཅད་རབ་ཏུ་སྟོན་པ་དང་། སྲིད་པའི་རྒྱ་མཚོ་ཡོངས་སུ་སྐེམས་ཤིང་སྙིང་རྗེ་ཆེན་པོའི་མཚོ་རྣམ་པར་འཕེལ་བར་བྱེད་པ་དང་། མི་ཁོམ་པ་དང་ངན་སོང་དང་། ངན་འགྲོ་དང་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་ཀྱི་སྒོ་གཅོད་ཅིང་།
en: how they turn back from the wheel of the continuum of saṃsāra’s ocean and enter the wheel of bodhisattva conduct and aspiration; how they defeat all the domains of the māras and manifest the arising of all the domains of the buddhas; how they dry up the ocean of existences and expand the ocean of great compassion; how they shut the gateway to all unfortunate existences, lower existences, and downfalls and open the gateway to the higher existences and nirvāṇa;

source: མཐོ་རིས་དང་མྱ་ངན་ལས་འདས་པའི་སྒོ་འབྱེད་པ་དང་། ཁམས་གསུམ་གྱི་གྲོང་ཁྱེར་གྱི་སྒོ་རྣམ་པར་གཅོད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་གི་སྒོ་རྣམ་པར་འབྱེད་པ་དང་། ཡོ་བྱད་ཐམས་ཅད་ཀྱི་སྲེད་པ་རྣམ་པར་སྤོང་ཞིང་འགྲོ་བ་ཐམས་ཅད་བསྡུ་བའི་སྨོན་ལམ་ཡོངས་སུ་བསྐྱེད་པར་འགྱུར་བ་མ་འཚལ་ལོ།
en: how they destroy the gateway to the city of the three realms and open the gateway to the palace of omniscience; how they reject craving for all things and develop the aspiration to gather all beings.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དགེ་སློང་རྒྱ་མཚོའི་སྤྲིན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: After he had said that, the bhikṣu Sāgara­megha said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པའི་སེམས་ཅན་རྣམས་ནི་བྱང་ཆུབ་ཏུ་སེམས་ཀྱང་མི་སྐྱེ་བའི་དགེ་བའི་རྩ་བ་སྒོ་ཀུན་ཏུ་སྣང་བ་རབ་ཏུ་ཐོབ་པ་དང་། ཐབས་ཀྱི་སྙིང་པོ་དང་ལྡན་པའི་ལམ་གྱི་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་སྣང་བས་རབ་ཏུ་སྣང་བར་འགྱུར་བ་དང་། བསོད་ནམས་ཀྱི་རྒྱ་མཚོའི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པ་དང་། དཀར་པོའི་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱུན་མི་འཆད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་བཀུར་བས་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་དང་། ལུས་དང་སྲོག་ལ་འཕངས་པ་མི་རྩི་བ་དང་། དངོས་པོར་འཛིན་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། མཐོན་དམན་མེད་པའི་ས་ལྟར་སེམས་མཉམ་པ་དང་། རང་བཞིན་གྱི་སྙིང་རྗེ་ཆེ་ཞིང་བྱམས་པར་སེམས་པ་དང་ལྡན་པ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་གནས་པར་འདུག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་མངོན་པར་མོས་པའི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེ་སྟེ།
en: “Noble one, the beings who have not planted roots of merit do not develop the aspiration for enlightenment. “The aspiration for enlightenment is developed by those beings who have attained the complete illumination, by the roots of merit, of all gateways, who are illuminated by the light of the wisdom of the samādhi of the path that has the essence of methods, who have accumulated a vast accumulation of an ocean of merit, who have a continuity of all good actions, who never tire of relying on all the kalyāṇamitras, who have no concern for their own bodies or lives, who are free from all fixation on things, whose minds are as even as completely level ground, who possess a nature of compassion and kindness, who are focused on all those dwelling in the states of existence, and who long for the scope of activity of the tathāgatas. “In other words, they have developed a motivation of great compassion so as to protect all beings.

source: འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་འགྲོ་བ་ཐམས་ཅད་ལ་སྙོམས་པར་ནན་ཏན་དུ་བྱ་བའི་ཕྱིར་བྱམས་པ་ཆེན་པོའི་སེམས་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཞི་བར་བྱ་བའི་ཕྱིར་བདེ་བའི་སེམས་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཕན་པའི་སེམས་དང་། འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་སྙིང་བརྩེ་བའི་སེམས་དང་། བསྒྲིབས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཆགས་པ་མེད་པའི་སེམས་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་དགང་བའི་ཕྱིར།
en: They have developed a motivation of great love so as to treat all beings equally. They have developed the motivation to bring happiness so as to bring to an end the mass of suffering of all beings. They have developed the motivation to bring benefit so as to turn beings away from all bad qualities. They have developed the motivation of sympathy so as to protect from all fear. They have developed the motivation of nonattachment so as to eliminate all obscurations.

source: རྒྱ་ཆེན་པོའི་སེམས་དང་ནམ་མཁའི་དབྱིངས་ཀུན་ཏུ་གཞོལ་ཞིང་ཀུན་ཏུ་འགྲོ་བར་བྱ་བའི་ཕྱིར་མཐའ་ཡས་པའི་སེམས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་ཞིང་རྣམ་པར་དམིགས་པར་བྱ་བའི་ཕྱིར་དྲི་མ་མེད་པའི་སེམས་དང་། དུས་གསུམ་གྱི་དམིགས་པ་མ་ལུས་པར་ཡེ་ཤེས་ཀྱིས་རྒྱས་པར་དགང་བའི་ཕྱིར་རྣམ་པར་དག་པའི་སེམས་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱ་བའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་སེམས་ཀྱང་སྐྱེ་བར་འགྱུར་རོ།
en: They have developed a vast motivation so as to pervade the entire realm of phenomena. They have developed an infinite motivation so as to extend throughout and be present everywhere in the realm of space. They have developed a stainless motivation so as to perceive the vision of all the tathāgatas. They have developed a pure motivation in order for their wisdom to extend throughout the three times without exception. They have developed a motivation for wisdom in order to dispel wisdom’s obscurations and enter into an ocean of omniscient wisdom.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་ཕྱོགས་ཀྱི་ལྗོངས་རྒྱ་མཚོའི་སྒོ་འདིར་ལོ་བཅུ་གཉིས་སུ་རྒྱ་མཚོ་ཆེན་པོ་འདི་ལ་དམིགས་ཏེ།
en: “Noble one, for twelve years I have dwelled in this area called Sāgara­mukha. I focused on the great ocean, facing it, and I contemplated the ocean in this way: ‘It is vast and immeasurable; it is stainless and clear; it is deep and unfathomable;

source: མངོན་དུ་བྱས་ནས་འདི་ལྟར་རྒྱ་མཚོ་རྒྱ་ཆེ་ཞིང་ཚད་མེད་པ་ལ་རྗེས་སུ་བསམ་པ་དང་། དྲི་མ་མེད་ཅིང་དང་བ་དང་། ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ་དང་། བགས་ཀྱིས་གཞོལ་ཞིང་ལེགས་པར་གནས་པ་དང་། རིན་པོ་ཆེའི་འབྱུང་གནས་དུ་མས་རྣམ་པར་བརྒྱན་པ་དང་། ཆུའི་ཕུང་པོ་ཚད་མེད་པ་དང་། ཁ་དོག་རྣམ་པ་ཐ་དད་པ་མང་ཞིང་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འབྱུང་པོ་མཐའ་ཡས་པའི་གནས་སུ་གྱུར་པ་དང་སྲོག་ཆགས་མང་པོ་སྣ་ཚོགས་ཀྱི་རྟེན་དུ་གྱུར་པ་དང་། སྤྲིན་ཆེན་པོའི་ཆར་ཡོངས་སུ་འཛིན་པ་དང་། གང་ཞིང་འབྲི་བར་འགྱུར་བ་མེད་པ་ལ་རྗེས་སུ་སེམས་པར་བྱེད་ཅིང་གནས་ཏེ།
en: it becomes steadily deeper and stays perfectly the same; it is a source of a variety of many jewels; it is a limitless mass of water; it has many different colors and is inconceivable; it has infinite spirits; it is the dwelling place of a multitude of various creatures; it receives the rain from great clouds; and it is neither filled nor diminished.’

source: རིགས་ཀྱི་བུ་དེ་ལ་ཁོ་བོས་འདི་སྙམ་དུ་བསམ་མོ། །འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རྒྱ་མཚོ་ཆེན་པོ་འདི་བས་ཀྱང་འཕགས་པར་རྒྱ་ཆེ་ལ་འདི་བས་ཀྱང་ཡངས་ཤིང་འདི་བས་ཀྱང་ཚད་མེད་ལ།
en: “Noble one, I thought, ‘Is there anything in this world realm that is greater than this ocean?

source: འདི་བས་ཀྱང་ངོ་མཚར་དང་ལྡན་པ་ལ་ལ་ཞིག་ཡོད་དམ་སྙམ་སྟེ། དེ་ལྟར་ཁོ་བོ་ཚུལ་བཞིན་དུ་བསམ་པ་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པར་གནས་པའི་ཚེ།
en: Is there something that is vaster, more measureless, deeper, or more marvelous?’ While I was engaged in attention to this through contemplation, there appeared a great lotus from under the great ocean.

source: རྒྱ་མཚོ་ཆེན་པོའི་འོག་གི་གཞི་ལས་པད་མོ་ཆེན་པོ་ནོར་བུ་རིན་པོ་ཆེ་ཨིནྡྲ་ནཱི་ལ་ཐུབ་པ་མེད་ཅིང་རྡོ་རྗེ་ལྟ་བུར་སྲ་བའི་ཆུ་བ་ཅན།
en: It had a stem of unsurpassable precious sapphire jewels that was as hard as diamond.

source: ནོར་བུ་རིན་པོ་ཆེ་བཻཌཱུཪྻ་དམ་པའི་རྒྱན་དང་ལྡན་པ།
en: It was adorned with great precious beryl jewels.

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལྟར་དྲི་མ་མེད་པའི་ལོ་མ་རྒྱ་ཆེན་པོ་ཅན།
en: It had vast leaves of stainless Jambu River gold.

source: དུས་དང་མཐུན་པའི་ཙན་དན་གྱི་སྙིང་པོའི་རྒྱན་གྱིས་བརྒྱན་པ། རིན་པོ་ཆེ་ཨ་སྨ་གར་བྷའི་ཟེ་བ་ཅན།
en: It displayed a yellow sandalwood pericarp and stamens of emerald jewels.

source: རྒྱ་མཚོ་ཙམ་དུ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྡོང་པོའི་ལྷུན་ནས་བཟུང་བ།
en: It was as vast and large as the ocean. A gathering of a million asura lords held the stem.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་བརྒྱ་ཕྲག་སྟོང་གི་དྲ་བས་ཀུན་ནས་ཡོག་པ།
en: It was covered from above by a network of a million various jewels.

source: ཀླུ་ཡི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྤོས་ཆུའི་ཆར་མངོན་པར་ཕབ་པ།
en: A million nāga lords sent down a rain of incense.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་དར་དང་རིན་པོ་ཆེའི་ལྡ་ལྡི་དང་སེ་མོ་དོ་མང་པོ་མཆུས་བཟུང་ཞིང་རབ་ཏུ་སྤྱངས་པ་མིའམ་ཅིའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཕན་པའི་སེམས་ཀྱིས་ཀུན་ནས་བལྟ་བ།
en: A million garuḍa lords hung from their beaks streamers of silk and strings of jewels. A million kinnara lords looked on with a wish to benefit.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་འཁོར་ནས་མངོན་པར་འདུད་པ།
en: A million mahoraga lords encircled the lotus and bowed down to it.

source: སྲིན་པོའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ལུས་འདུད་ཅིང་མངོན་པར་མཆོད་པ།
en: A million rākṣasa lords bowed down and made offerings to it.

source: དྲི་ཟའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རོལ་མོ་དང་གླུ་སྣ་ཚོགས་སྙན་པས་བསྟོད་ཅིང་མཆོད་པ།
en: A million gandharva lords played music and sang various melodious songs in praise and as an offering.

source: ལྷའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། སྤོས་དང་ཕྲེང་བ་དང་། བདུག་སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། ལྷའི་བ་དན་གྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་ཕབ་པ།
en: A million deva lords sent down rain from clouds of divine flowers, perfume, garlands, incense, ointments, powders, clothing, parasols, banners, and divine flags.

source: ཚངས་པའི་དབང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྤྱི་བོས་གཏུགས་ཏེ། ཕྱག་འཚལ་ཞིང་མཆོད་པ།
en: A million Brahmakāyika lords reverently bowed their heads, paid homage, and made offerings.

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཐལ་མོ་སྦྱར་ཅིང་ཕྱག་བྱ་བ།
en: A million Śuddhāvāsa devas placed their palms together and paid homage.

source: མིའི་དབང་པོ་འཁོར་ལོས་སྒྱུར་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རིན་པོ་ཆེ་བདུན་གྱིས་བསུ་ཞིང་མངོན་པར་མཆོད་པ། རྒྱ་མཚོའི་ལྷ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མངོན་པར་མཐོན་ཅིང་ཕྱག་བྱ་བ།
en: A million cakravartins, lords of humans, welcomed it with an offering of the seven jewels, and a million ocean devas rose up and paid homage to it.

source: ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་དད་བརྒྱ་སྟོང་ཕྲག་བཅུས་འོད་ཟེར་གྱི་རྒྱན་གྱིས་རབ་ཏུ་སྣང་བར་བྱས་པ།
en: “A million precious asteria jewels displaying light rays adorned it.

source: ནོར་བུ་རིན་པོ་ཆེ་བསོད་ནམས་ཀྱིས་དག་པ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མཁོས་སུ་ཕེབས་པར་འཕེལ་བས་རབ་ཏུ་བརྒྱན་པ།
en: A million perfectly arranged precious jewels of pure merit beautified it.

source: ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་སྙིང་པོ་རབ་ཏུ་གསལ་བར་བྱས་པ།
en: A million radiant precious jewels were its stainless center.

source: ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་སྙིང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་དཔལ་ཆེན་པོ་ཤིན་ཏུ་འབར་བར་གྱུར་པ།
en: It blazed with a million glorious precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེའི་མཛོད་སྣང་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མཐའ་ཡས་པར་སྣང་བར་བྱས་པ།
en: It had the infinite shining of a million variegated treasures of precious jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་འཛམ་བུའི་ཆུ་ཀླུང་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཡོངས་སུ་སྟོན་པར་གནས་པས་རབ་ཏུ་བརྒྱན་པ།
en: It was beautified by a perfectly arranged display of a million precious Jambudvīpa jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེའི་སེང་གེ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཐུབ་པ་མེད་པར་བརྒྱན་པ།
en: It had an unsurpassable display of a million precious diamond jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་ཉི་མའི་སྙིང་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རྒྱ་ཆེར་གསལ་བར་བསྒྲུབས་པ།
en: It had a plenitude of illustrious blazing precious sunstone jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་འབར་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཁ་དོག་སྣ་ཚོགས་སུ་བརྒྱན་པ།
en: It had an arrangement of a million radiant precious jewels of various colors.

source: ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་མི་ཟད་པའི་རྒྱན་དང་འོད་འབར་བར་བྱས་པ་བྱུང་སྟེ།
en: It had the unceasingly brightly shining display of a million precious wish-fulfilling kings of jewels.

source: པདྨ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བའོ། །བྱང་ཆུབ་སེམས་དཔའི་བསམ་པས་ཡོངས་སུ་བརྟན་པའོ།
en: “That great lotus had arisen from a tathāgata’s transcendent roots of merit and remained through the aspiration of bodhisattvas.

source: །ཕྱོགས་ཐམས་ཅད་དུ་མངོན་པར་དམིགས་སུ་ཡོད་པའོ།
en: It could be perceived in all directions.

source: །སྒྱུ་མའི་རྣམ་པའི་ཆོས་ཀྱིས་བྱུང་བའོ།
en: It had come forth as an illusory phenomenon.

source: །རྗེན་པའི་དྲི་མ་མེད་པའི་ལས་ཀྱིས་བྱུང་བའོ།
en: It had been created from pure, stainless actions.

source: །ཉོན་མོངས་པ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་གྱིས་བརྒྱན་པའོ།
en: It was the display of the unalloyed true nature.

source: །རྨི་ལམ་ལྟ་བུའི་ཆོས་ཉིད་ཀྱིས་ཡོངས་སུ་བྱུང་བའོ།
en: It was produced like a phenomenon in a dream.

source: །མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་གྱིས་རྒྱས་བཏབ་པའོ།
en: It was sealed as being a noncomposite phenomenon.

source: །ཆགས་པ་མེད་པའི་ཆོས་ཀྱི་ཚུལ་དང་ལྡན་པའོ།
en: It possessed the nature of being free of attachment.

source: །ཕྱོགས་ཀྱི་ཁམས་ཀུན་ཏུ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པའོ།
en: It pervaded the domains of the directions throughout the vast realm of phenomena.

source: །སངས་རྒྱས་ཀྱི་ཡུལ་བརྗོད་པ་དང་མཐུན་པ་སྟེ།
en: It accorded with the majestic radiance of the domain of buddhahood.

source: དེའི་རྣམ་པ་དང་ཡོན་ཏན་དང་དབྱིབས་དང་། ཁ་དོག་དང་རྒྱན་གྱིས་མཐར་ཕྱིན་པ་ནི་བསྐལ་པ་བརྒྱ་སྟོང་གྲངས་མེད་པར་ཡང་ཁོང་དུ་ཆུད་པར་མི་ནུས་ཏེ།
en: It would be impossible to fully comprehend its display of form, qualities, shape, and colors even in hundreds of thousands of asaṃkhyeya kalpas.

source: པད་མོ་ཆེན་པོ་དེ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་པས་ཁྱབ་ཅིང་ཡོངས་སུ་རྒྱས་པར་མཐོང་ངོ་།
en: “I saw the clear image of the body of a tathāgata sitting cross-legged on that great lotus and filling it.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་ཡང་འདི་ནས་བཟུང་བ་ནས། སྲིད་པའི་རྩེ་མོའི་བར་གྱི་མཐས་ཀླས་པར་མཐོང་ངོ་།
en: I saw that tathāgata’s body extending from here up to the summit of existence.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་གདན་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མཐོང་ངོ་།
en: I saw the inconceivable display of that tathāgata’s seat.

source: །འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། མཚན་ཕུན་སུམ་ཚོགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དཔེ་བྱད་བཟང་པོ་སྣ་ཚོགས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སྤྱི་གཙུག་ལྟར་མི་མཐོང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ལྗགས་ཡངས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མཐོང་ངོ་།
en: I saw the inconceivable circle of his followers, the inconceivable extent of his halo, his inconceivable perfect primary signs of a great being, his inconceivable various secondary features of a great being, his inconceivable majesty and power, his inconceivable miracles of buddhahood, the inconceivable color of the tathāgata’s body, the inconceivable invisible crown of his head, and his inconceivable vast tongue.

source: །སངས་རྒྱས་ཀྱི་གསུང་གི་རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་བསམ་གྱིས་མི་ཁྱབ་པའང་ཐོས་སོ།
en: “I heard the inconceivable display of that buddha’s speech and the inconceivable range of his voice.

source: །སྟོབས་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་མི་བསྙེངས་པའི་རྒྱན་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་སྟོབས་མངོན་པར་བསྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་རྗེས་སུ་ཤེས་སོ།
en: I comprehended his inconceivable limitless strength, his inconceivable display of fearlessness, and his inconceivable accomplishment of the power of discernment.

source: །སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་དག་པར་བསྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་རྗེས་སུ་དྲན་ནོ།
en: I remembered his inconceivable past accomplishment of bodhisattva conduct.

source: །མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡང་མཐོང་ངོ་།
en: I saw the inconceivable miracle of his complete enlightenment.

source: །ཆོས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་མངོན་པར་བསྒྲགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཡོངས་སུ་བསྟན་པ་རྣམ་པར་དམིགས་པའི་གནས་དང་། རྒྱན་བསམ་གྱིས་མི་ཁྱབ་པའང་ཐོས་སོ།
en: I heard the inconceivable resounding of the thunder of Dharma and the inconceivable array of the perceived communication of the complete teaching.

source: །གཡས་གཡོས་ཀྱི་སྐུའི་རྣམ་པ་ཚད་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་ཅན་གྱི་དོན་དང་དགོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་གྲུབ་པར་འགྱུར་བའང་མཐོང་ངོ་།
en: I saw the inconceivable, immeasurable right and left parts of his body and the inconceivable accomplishment of a body that benefits beings.

source: །དེ་བཞིན་གཤེགས་པ་དེས་ཀྱང་ཕྱག་གཡས་པ་བརྐྱང་ཞིང་ཁོ་བོའི་མགོ་ལ་བྱུགས་ནས། ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ནས་མྱིག་ཅེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རབ་ཏུ་བརྗོད་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་དང་། རྣམ་པ་ཐ་དད་པ་ཐམས་ཅད་རབ་ཏུ་སྣང་བ་ཆོས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ལ་ཡང་དག་པར་གཞོལ་ཞིང་སྣང་པར་བྱེད་པ། ཞིང་གི་དཀྱིལ་འཁོར་དང་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་དག་པས་ཡོངས་སུ་སྣང་བ། ཕས་ཀྱི་རྒོལ་བའི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཐོར་བ་བདུད་ཀྱི་དཀྲུགས་མའི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་འཇོམས་པ། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཤིན་ཏུ་ཚིམ་པར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་ཐིབས་པོ་རབ་ཏུ་སྣང་བར་བྱེད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ།
en: “That tathāgata extended his right hand and stroked my head and taught me a Dharma teaching called All-Seeing Eyes , which is the field of all the tathāgatas, reveals the conduct of bodhisattvas, illuminates the different bases of the realm of phenomena, illuminates the compiled field of all Dharmas, is the pure vision of the forms of the range of all realms, scatters the entire range of adversaries, defeats the entire range of the discord of the māras, brings satisfaction to all realms of beings, illuminates the darkness in the minds of all beings, communicates in accord with the thoughts of all beings, and illuminates the turning wheel of the faculties of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོའི་འཁོར་ལོའི་རྒྱུད་དང་། མཐུ་སྣང་བར་བྱེད་པ་ཡང་དག་པར་བསྟན་ཏེ། ཁོ་བོས་ཡང་ཀུན་ནས་མིག་གི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བླངས་སོ། །བཟུང་ངོ་སྤེལ་ཏོ་བསམས་སོ།
en: “I acquired, possess, follow, and contemplate this Dharma teaching called All-Seeing Eyes

source: །དེ་ལྟར་བཟུང་བ་དེ་ལའང་བྲི་ན་ནི་སྣག་ཚ་རྒྱ་མཚོ་ཆེན་པོའི་ཕུང་པོ་ཙམ་དང་། སྨྱི་གུའི་ཕུང་པོ་རི་རབ་རིའི་རྒྱལ་པོ་ཙམ་ཟད་པར་གྱུར་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ལས་ལེའུ་རེ་རེ་དང་སྒོ་རེ་རེ་དང་ཆོས་ཀྱི་ཚུལ་རེ་རེ་དང་ཆོས་ཀྱི་ཚིག་རྣམ་པར་ཕྱེ་བ་རེ་རེ་ལས་ཀྱང་ཟད་པ་འམ། འགྲིབ་པ་འམ། འབྱང་བ་འམ། མཐར་ཐུག་པའམ།
en: “Having thus acquired it, if one were to use a volume of ink equal to the great ocean and a heap of pens the size of Sumeru , the king of mountains, to write it out, one would not be able reach the end of a single chapter, a single gateway, a single Dharma way, or a single category of words from that Dharma teaching, nor could one diminish what is to be written, complete it, finish it, or reach the end.

source: མཐའ་ཟད་པར་འགྱུར་བ་དམིགས་པར་མི་རུང་ངོ་། །རིགས་ཀྱི་བུ་དེ་ལྟར་བདག་གིས་ལོ་བཅུ་གཉིས་ཚང་བར་ཆོས་ཀྱི་རྣམ་གྲངས་ཀུན་ནས་མིག་ཅེས་བྱ་བ་འདི་ལ་ཉི་མ་གཅིག་ཅིང་ཡང་ཐོས་པ་འཛིན་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཁོང་དུ་ཆུད་དོ།
en: “Noble one, in that way I have possessed this Dharma teaching called All-Seeing Eyes for an entire twelve years. Having thus acquired it, in a single day I can understand countless chapters through the illumination of the light of the power of retention called remembering what is heard

source: །ཞི་བའི་སྒོའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ལ་ཞུགས་སོ།
en: I can comprehend countless chapters through the illumination of the light of the power of retention called the gateway to peace

source: །གློང་མཐའ་ཡས་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ལ་ཡང་དག་པར་འཇུག་གོ །ས་ལ་རྣམ་པར་དཔྱོད་ཅིང་རྗེས་སུ་རྟོག་པར་བྱེད་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་རྣམ་པར་བསྒོམས་ཏེ་རྣམ་པར་དབྱེ་བ་བྱས་སོ།
en: I can fathom countless chapters through the illumination of the light of the power of retention called endless revolving . I can consider and investigate countless chapters through the illumination of the light of the power of retention called examining and analyzing the levels

source: །གཟི་བརྗིད་དང་ལྡན་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཡོངས་སུ་བླངས་སོ།
en: I can conclude countless chapters through the illumination of the light of the power of retention called majestic

source: །པད་མོའི་རྒྱན་གྱི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་མངོན་པར་བསྒྲུབས་སོ།
en: I can accomplish countless chapters through the illumination of the light of the power of retention called array of lotuses

source: །དབྱངས་ཀྱི་ཚུལ་གྱི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཡང་དག་པར་བཤད་དོ།
en: I can elucidate countless chapters through the illumination of the light of the power of retention called distinct voice

source: །ནམ་མཁའི་སྙིང་པོའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་རབ་ཏུ་ཕྱེ་བའོ།
en: I can distinguish countless chapters through the illumination of the light of the power of retention called the essence of space

source: །སྐར་མ་བརྩེགས་པའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཤིན་ཏུ་རྒྱས་པར་བྱས་སོ།
en: I can expand on countless chapters through the illumination of the light of the power of retention called the multitude of stars

source: །རྒྱ་མཚོ་སྙིང་པོའི་གཟུངས་ཀྱི་འོད་སྣང་བས་ལེའུ་གྲངས་མེད་པ་ཞིག་ཡོངས་སུ་བཀོད་དོ།
en: I can arrange countless chapters through the illumination of the light of the power of retention called the essence of the ocean
